cf/InformationRegisters/СообщенияИУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СообщенияИУведомления</Name>
			<Comment>Параметры сообщения и уведомлений система</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Comment>Статус отправления сообщения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПрикрепленныхФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлепаяКопия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлепаяКопияТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОшибокОбмена</v8:Type>
						<v8:Type>cfg:DocumentRef.Обращение</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеКонфигурации</v8:Type>
						<v8:Type>cfg:CatalogRef.Функции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/СообщенияИУведомления/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьСообщенияПовторно(Команда)
	
	МассивВыделенныхСообщений = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Сообщение из МассивВыделенныхСообщений Цикл
		
		Статус = ОтправитьСообщение(Сообщение);
		
		Если Статус <> "Сообщение отправлено" Тогда
			Сообщить(Статус);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры


&НаСервере 
Функция ОтправитьСообщение(Сообщение) 
	
	Возврат(ТИ.ПовторноеОтправлениеСообщений(Сообщение));
	
КонецФункции

&НаКлиенте
Процедура кнУдалитьСообщение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		УдалитьЗаписьНаСервере(Элементы.Список.ТекущаяСтрока);
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УдалитьЗаписьНаСервере(КлючЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.СообщенияИУведомления.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,КлючЗаписи);
	
	МенеджерЗаписи.Прочитать();
	
	Попытка
		
		МенеджерЗаписи.Удалить();
		
	Исключение
		
		Сообщить("Не удалось удалить запись по причине:" + ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры // УдалитьЗаписьНаСервере(Элементы.ТаблицаУведомлений.ТекущаяСтрока)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") и Параметры.Отбор.Свойство("Документ") Тогда
		
		//Элементы.ДатаРегистрации.Видимость = Ложь;
		//Элементы.НаличиеПрикрепленныхФайлов.Видимость = Ложь;
		//Элементы.Отправлено.Видимость = Ложь;
		
	КонецЕсли; 	
	
КонецПроцедуры
